test/performance/artillery/config.yml
config:
  processor: "./functions/scenarioHelpers.js"  # JavaScript file with custom functions
  target: '${TARGET_URL}' # API base URL
  phases:
    - duration: 60 # Test duration in seconds
      arrivalRate: 5 # New virtual users per second
      rampTo: 10 # Ramp up to 10 virtual users per second
      name: Warm up phase
    - duration: 60 
      arrivalRate: 10 
      rampTo: 50 
      name: Ramp up to peak load
    - duration: 120 
      arrivalRate: 50
      name: Sustained peak load